[{"company": "Amazon", "title": "Data Center Engineering Operations Technician, AMER Burrow/ALZ Operations", "text": "AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. You’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.<br/><br/>Key job responsibilities<br/>- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability<br/>- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)<br/>- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)<br/>- Perform rack installs and rack decommissioning within internal SLA<br/>- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment<br/>- Technical writing to support change management program<br/>- Monitor daily work requests and manage to resolution, and execute projects from conception to completion<br/>- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures & local legislation<br/>- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.<br/>- Role may support more than one location/site.<br/><br/>Physical Requirements:<br/>Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:<br/>- Regularly lift and/or move up to 39 pounds independently<br/>- Participate in group lifts for 40+ pounds<br/>- Maintain balance and perform construction tasks while on a ladder<br/>- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position<br/>- Work in an environment requiring provided ear protection<br/><br/>A day in the life<br/>This role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.<br/><br/>About the team<br/>Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.<br/><br/>Amazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.<br/><br/>We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.<br/><br/>Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.<br/><br/>We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.", "url": "https://www.amazon.jobs/en/jobs/2976119/data-center-engineering-operations-technician-amer-burrow-alz-operations", "location": "US, TX, Garland"}, {"company": "Amazon", "title": "Delivery Consultant - Migrations & Modernization, WWPS ProServe", "text": "The Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle. Possessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project. <br/> <br/>The AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.<br/><br/>This position requires that the candidate selected must currently possess and maintain an active TS/SCI security clearance. The position further requires that, after start, the selected candidate have the ability to obtain and maintain an active TS/SCI security clearance with polygraph or commensurate clearance for each government agency for which they perform AWS work.<br/><br/>Key job responsibilities<br/>As an experienced technology professional, you will be responsible for: <br/>- Designing and implementing complex, scalable, and secure AWS solutions tailored to customer needs<br/>- Providing technical guidance and troubleshooting support throughout project delivery<br/>- Collaborating with stakeholders to gather requirements and propose effective migration strategies<br/>- Acting as a trusted advisor to customers on industry trends and emerging technologies<br/>- Sharing knowledge within the organization through mentoring, training, and creating reusable artifacts<br/><br/><br/>About the team<br/>Diverse Experiences - AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.<br/><br/>Why AWS? - Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.<br/><br/>Inclusive Team Culture - Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.<br/><br/>Mentorship & Career Growth - We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.<br/><br/>Work/Life Balance - We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.<br/>", "url": "https://www.amazon.jobs/en/jobs/2965217/delivery-consultant-migrations-modernization-wwps-proserve", "location": "US, VA, Arlington"}, {"company": "Amazon", "title": "Delivery Consultant - Migrations & Modernization, WWPS ProServe", "text": "The Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle. Possessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project. <br/> <br/>The AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.<br/><br/>This position requires that the candidate selected be a US Citizen and must currently possess an active Secret security clearance. The position further requires that, after start, the selected candidate have the ability to obtain/maintain an active TS/SCI security clearance and satisfy other security related requirements.<br/><br/>Key job responsibilities<br/>As an experienced technology professional, you will be responsible for: <br/>- Designing and implementing complex, scalable, and secure AWS solutions tailored to customer needs<br/>- Providing technical guidance and troubleshooting support throughout project delivery<br/>- Collaborating with stakeholders to gather requirements and propose effective migration strategies<br/>- Acting as a trusted advisor to customers on industry trends and emerging technologies<br/>- Sharing knowledge within the organization through mentoring, training, and creating reusable artifacts<br/><br/><br/>About the team<br/>Diverse Experiences - AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.<br/><br/>Why AWS? - Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.<br/><br/>Inclusive Team Culture - Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.<br/><br/>Mentorship & Career Growth - We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.<br/><br/>Work/Life Balance - We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.<br/>", "url": "https://www.amazon.jobs/en/jobs/2965365/delivery-consultant-migrations-modernization-wwps-proserve", "location": "US, VA, Arlington"}, {"company": "Amazon", "title": "Senior Delivery Consultant - Migrations and Modernization, WWPS ProServe", "text": "The Amazon Web Services Professional Services (ProServe) team is seeking a skilled Delivery Consultant to join our team at Amazon Web Services (AWS). In this role, you'll work closely with customers to design, implement, and manage AWS solutions that meet their technical requirements and business objectives. You'll be a key player in driving customer success through their cloud journey, providing technical expertise and best practices throughout the project lifecycle. Possessing a deep understanding of AWS products and services, as a Delivery Consultant you will be proficient in architecting complex, scalable, and secure solutions tailored to meet the specific needs of each customer. You’ll work closely with stakeholders to gather requirements, assess current infrastructure, and propose effective migration strategies to AWS. As trusted advisors to our customers, providing guidance on industry trends, emerging technologies, and innovative solutions, you will be responsible for leading the implementation process, ensuring adherence to best practices, optimizing performance, and managing risks throughout the project. <br/> <br/>The AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries.<br/><br/>This position requires that the candidate selected must currently possess and maintain an active TS/SCI security clearance. The position further requires that, after start, the selected candidate have the ability to obtain and maintain an active TS/SCI security clearance with polygraph or commensurate clearance for each government agency for which they perform AWS work.<br/><br/><br/>Key job responsibilities<br/>As an experienced technology professional, you will be responsible for: <br/>- Designing and implementing complex, scalable, and secure AWS solutions tailored to customer needs<br/>- Providing technical guidance and troubleshooting support throughout project delivery<br/>- Collaborating with stakeholders to gather requirements and propose effective migration strategies<br/>- Acting as a trusted advisor to customers on industry trends and emerging technologies<br/>- Sharing knowledge within the organization through mentoring, training, and creating reusable artifacts<br/><br/>About the team<br/>Diverse Experiences: AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.<br/><br/>Why AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.<br/><br/>Inclusive Team Culture - Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.<br/><br/>Mentorship & Career Growth - We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.<br/><br/>Work/Life Balance - We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. ", "url": "https://www.amazon.jobs/en/jobs/2965270/senior-delivery-consultant-migrations-and-modernization-wwps-proserve", "location": "US, VA, Arlington"}, {"company": "Amazon", "title": "Executive Assistant,  AWS Finance", "text": "AWS Global Sales Finance is hiring for an Executive Assistant position supporting two AWS Global Sales Finance Finance Directors based in Mumbai and London. This person will manage complex calendars and administrative tasks independently, coordinate with global stakeholders and other Executive Assistants while maintaining a high level of confidentiality and data privacy. Our ideal candidate is self-driven and highly organized with professional communication skills. <br/><br/>Key job responsibilities<br/>Manage complex calendars and scheduling with diplomacy and discretion.<br/><br/>Organize, prioritize and appropriately handle time-sensitive, confidential information and ensure action required is addressed in a timely manner.<br/><br/>Organize, execute, and assist with team activities (staff meeting agendas, on-sites/off-sites, team social events, etc.).<br/><br/>Schedule cost effective air/hotel/ground transportation.<br/><br/>Create detailed travel itineraries both domestic and international (including smooth transitions between time zones).<br/><br/>Coordinate with in-house travel agents and manage international travel process.<br/><br/>Submit expense reports in a timely fashion.<br/>Coordinate closely with Recruiting teams, Facilities team, HR team, and other Executive Assistants within the Amazon community.<br/><br/>Track and help drive completion of key deliverables and follow up on pending actions or items.<br/><br/><br/>About the team<br/>Amazon Global Sales Finance provide comprehensive long-term focused finance leadership across all sales functions and assists the business in evaluating options and investments by driving insights with depth and analytics", "url": "https://www.amazon.jobs/en/jobs/2983984/executive-assistant-aws-finance", "location": "IN, MH, Mumbai"}, {"company": "Amazon", "title": "Executive Assistant,  AWS Finance", "text": "AWS Global Sales Finance is hiring for an Executive Assistant position supporting two AWS Global Sales Finance Finance Directors based in Mumbai and London. This person will manage complex calendars and administrative tasks independently, coordinate with global stakeholders and other Executive Assistants while maintaining a high level of confidentiality and data privacy. Our ideal candidate is self-driven and highly organized with professional communication skills. <br/><br/>Key job responsibilities<br/>Manage complex calendars and scheduling with diplomacy and discretion.<br/><br/>Organize, prioritize and appropriately handle time-sensitive, confidential information and ensure action required is addressed in a timely manner.<br/><br/>Organize, execute, and assist with team activities (staff meeting agendas, on-sites/off-sites, team social events, etc.).<br/><br/>Schedule cost effective air/hotel/ground transportation.<br/><br/>Create detailed travel itineraries both domestic and international (including smooth transitions between time zones).<br/><br/>Coordinate with in-house travel agents and manage international travel process.<br/><br/>Submit expense reports in a timely fashion.<br/>Coordinate closely with Recruiting teams, Facilities team, HR team, and other Executive Assistants within the Amazon community.<br/><br/>Track and help drive completion of key deliverables and follow up on pending actions or items.<br/><br/><br/>About the team<br/>Amazon Global Sales Finance provide comprehensive long-term focused finance leadership across all sales functions and assists the business in evaluating options and investments by driving insights with depth and analytics", "url": "https://www.amazon.jobs/en/jobs/2993051/executive-assistant-aws-finance", "location": "GB, London"}, {"company": "Amazon", "title": "Data Center Engineering Operations Technician , DCC Communities ", "text": "How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most powerful data centers. Our Data Center Engineering Operations team maintain and operate our critical infrastructure systems so that they are prepared to stand up against any situation.<br/><br/>AWS has the world’s largest cloud computing portfolio. As an Amazonian you will work in some of the most sophisticated, safe, and secure data centers in the world. Our Engineering Operations Technicians (EOT’s) help keep them that way by working with the brightest minds from around the globe to help test and implement the newest technology and work practices to meet the demands of a changing market.<br/><br/>We have a passion for learning and evolving, it’s how we have helped define ourselves as leaders in the industry. Let’s work hard, have fun, and make history!<br/><br/><br/>Key job responsibilities<br/>- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability<br/>- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)<br/>- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)<br/>- Perform rack installs and rack decommissioning within internal SLA <br/>- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment<br/>- Technical writing to support change management program <br/>- Monitor daily work requests and manage to resolution, and execute projects from conception to completion<br/>- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures & local legislation<br/>- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.<br/>- Role may support more than one location/site.<br/><br/>Physical Requirements:<br/>Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:<br/>- Regularly lift and/or move up to 39 pounds independently <br/>- Participate in group lifts for 40+ pounds<br/>- Maintain balance and perform construction tasks while on a ladder<br/>- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position<br/>- Work in an environment requiring provided ear protection<br/><br/><br/>A day in the life<br/>This role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.<br/><br/>About the team<br/>AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.<br/><br/>You’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.<br/><br/>Why AWS?<br/>Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.<br/><br/>Diverse Experiences<br/>AWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. <br/><br/>Inclusive Team Culture<br/>Here at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.<br/><br/>Mentorship & Career Growth<br/>We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. <br/><br/>Work/Life Balance<br/>We value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. <br/>", "url": "https://www.amazon.jobs/en/jobs/2985102/data-center-engineering-operations-technician-dcc-communities", "location": "US, VA, Herndon"}, {"company": "Amazon", "title": "Customer Service Associate- Delhi India", "text": "<strong>Work from Office with Amazon Customer Service!</strong><br><br><strong>Role: </strong> Customer Service Associate<br><strong>Job Type: Contractual </strong><br><strong>Location: </strong>Work from Office in Delhi/Noida<br><br>Our mission at Amazon is to be Earth’s most customer-centric company, and our award-winning Customer Service team is a key part of achieving that goal. Doing our best for our customers is where we get our energy, and that’s why you’ll find we approach things differently here. You won’t be asked to read from a script or learn dialogue by heart. Instead we’ll provide you with the training you need to problem solve for our customers. You’ll bring your unique personality to every customer conversation and deliver the exceptional support experience our customers love.<br><br><strong>What will you do as a Customer Service Associate?</strong><br>As an Amazon Customer Service Associate, you have a very clear purpose: to prevent issues, solve queries, and delight our customers. You’ll be the first point of contact for our customers by answering their requests through phone, chat and/or email – this includes everything from order and product questions to payment matters and website guidance. Our Customer Service Associates use a variety of tools to navigate, research, and review solutions, and communicate effectively with customers<br><br>What strengths will you bring?\n<ul><li>    Hard-working, articulate, and detail-oriented</li><li>    Friendly and customer-focused in every situation</li><li>    Ability to learn quickly and embrace change</li><li>    Comfortable multi-tasking in a high-energy environment.</li></ul>\n<br><strong>What benefits will you receive?</strong><br>One of the great things about joining Amazon’s Customer Service team is that you don’t need past experience in customer service. You’ll receive training and be provided with a complete equipment package when you join. Additionally, we offer a number of benefits, including:<br> \n<ul><li>Medical insurance</li><li>Pension plan</li><li>Internet allowance</li><li>Lifestyle benefits and retail discounts through our Amazon Extras program</li><li>Expert training and ongoing opportunities to learn more and develop your skills</li></ul>\n<br><strong>If this role sounds like it’s for you, then click on the link below to start the application process!</strong><br>You’ll need to allow 3 hours to complete the full application, including assessments which will evaluate your suitability for the role. You will have the option to save your application during the process and return to it if necessary. We recommend using a laptop/desktop computer in order to get the best experience.<br><br>If successful, we will contact you about next steps!<br><br><em>Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build.</em><br><br><em>Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice to know more about how we collect, use and transfer the personal data of our candidates.</em>", "url": "https://www.amazon.jobs/en/jobs/SF250118839/customer-service-associate-delhi-india", "location": "IN, UP, Noida"}, {"company": "Amazon", "title": "Product Lifecycle Electrical Engineer, DCC Communities, Electrical Solutions Product Lifecycle Engineering Team", "text": "As a Product Lifecycle Engineer, you will own and continuously improve electrical power distribution products that are deployed across our global data center network.  You will collaborate with the product development team to gain a deep understanding of the products as they are being developed.  You will then support the product as design owner during the production scale-up phase and beyond.  You will understand, review and modify detailed electrical equipment specifications and evaluate the merits and risks of design changes.  You will be working with detailed design drawings, assembly processes and acceptance criteria to ensure the product and subassemblies meet their desired requirements.  You will be a go to technical resource as a product expert supporting global issues and design solutions.<br/><br/>This role focuses on switchgear, power distribution panels and circuit breakers, requiring deep technical expertise in power distribution systems and manufacturing processes.  You will visit vendors to review manufacturing processes, make design changes to support manufacturability, enabling improved throughput, quality and cost.  Travel to vendors will require international travel up to 30%.<br/><br/><br/>Key job responsibilities<br/>• Collaborate with other disciplines such as design engineering, construction, reliability and operations to support electrical distribution products<br/>• Work with global suppliers and manufacturers to design product improvements<br/>• Manage multiple concurrent projects across various geographic zones<br/>• Develop and deliver comprehensive training modules for partner teams on electrical products<br/>• Translate complex technical concepts into clear, concise language for diverse audiences<br/>• Actively gather and analyze customer feedback to drive product improvements<br/>• Contribute to and maintain the global knowledge base, fostering a culture of continuous improvement at scale<br/>", "url": "https://www.amazon.jobs/en/jobs/2945252/product-lifecycle-electrical-engineer-dcc-communities-electrical-solutions-product-lifecycle-engineering-team", "location": "IE, D, Dublin"}, {"company": "Amazon", "title": "Versandkoordinator im Kundenservice (m/w/d)  im Verteilzentrum Knuellwald ", "text": "Die nachfolgende Stelle ist für 12 Monate befristet.<br/><br/>Selbst die effizientesten Prozesse erfordern Vorbereitung für den Fall unvorhergesehener Umstände. Die Delivery Station Liaison Agents von Amazon sind direkt mit unseren Kund:innen in Kontakt. Sie sorgen dafür, dass verpasste Lieferungen erfolgreich zugestellt und Kundenanfragen effektiv bearbeitet werden. Was unsere Kund:innen auch brauchen – Du gehst zeitnah auf ihre Anfragen ein und sorgst für ein reibungsloses Kundenerlebnis. <br/><br/>Key job responsibilities<br/>- Kontaktieren von Kund:innen <br/>- Untersuchung und Lösung von Lieferproblemen, falls erforderlich in Zusammenarbeit mit unseren Logistikteams und Lieferpartnern<br/>- Führung von täglichen, wöchentlichen und monatlichen Aufzeichnungen über den Status von Kundenanfragen<br/>- Einhaltung von Arbeitsanweisungen und Schutz von Kundendaten<br/>- Unterstützung bei der internen Kommunikation, einschließlich mit Präsentationen, und Beiträge zu Programmen für die kontinuierliche Verbesserung und das interne Engagement<br/><br/><br/>A day in the life<br/>Du arbeitest in einem unserer Last-Mile-Verteilzentren, das Amazons modernste Technologien umfasst. Während des Versands und der Lieferung von Bestellungen kommunizierst Du je nach Bedarf mit unseren Logistikzentren sowie unseren Partnern, Lieferfirmen und Kund:innen, wenn sie Hilfe oder Informationen benötigen. Müssen Kund:innen Lieferungen umplanen, benachrichtigst Du unsere Lieferpartner entsprechend. Lieferprobleme, die Dir auffallen, löst Du unverzüglich, damit unsere Kund:innen jedes Mal ein großartiges Erlebnis genießen, ohne Amazon kontaktieren zu müssen.<br/>Du arbeitest im Herzen der Logistik von Amazon und entwickelst das erforderliche Fachkönnen in sowohl Logistik als auch ausgezeichnetem Kundenservice, mit dem sich Amazon von anderen abhebt. Du bist tagtäglich mit unseren Kund:innen in Kontakt und nutzt Dein eingehendes Verständnis unserer Lieferketten sowie Deine Kenntnisse lokaler Lieferwege und Lager. ", "url": "https://www.amazon.jobs/en/jobs/2925170/versandkoordinator-im-kundenservice-m-w-d-im-verteilzentrum-knuellwald", "location": "DE, HE, Knuellwald"}]